/*
* @Author: 12574
* @Date:   2018-04-23 21:59:41
* @Last Modified by:   12574
* @Last Modified time: 2018-04-24 14:26:55
*/
var _cities = {
	cityInfo : {
		'北京' : ['北京'],
		'上海' : ['上海'],
		'天津' : ['天津'],
		'重庆' : ['重庆'],
		'河北省' : ['石家庄' ,'保定市', '秦皇岛' ,'唐山市', '邯郸市' ,'邢台市', '沧州市', '承德市' ,'廊坊市' ,'衡水市', '张家口'],
		'山西省' : ['太原市' ,'大同市', '阳泉市' ,'长治市' ,'临汾市' ,'晋中市', '运城市' ,'晋城市' ,'忻州市' ,'朔州市' ,'吕梁市'],
		'内蒙古自治区' : [ '呼和浩特' ,'呼伦贝尔', '包头市' ,'赤峰市' ,'乌海市', '通辽市' ,'鄂尔多斯' ,'乌兰察布' ,'巴彦淖尔' ],
		'辽宁省' : ['沈阳市' ,'盘锦市', '鞍山市', '抚顺市', '本溪市', '铁岭市' ,'锦州市' ,'丹东市' ,'辽阳市', '葫芦岛','阜新市', '朝阳市' ,'营口市'],
		'吉林省' : ['吉林市' ,'通化市', '白城市' ,'四平市', '辽源市','松原市', '白山市' ],
		'黑龙江省' : ['哈尔滨市', '牡丹江' ,'大庆市' ,'鸡西市' ,'鹤岗市' ,'绥化市' ,'双鸭山' ,'七台河', '佳木斯' ,'黑河市' ,'齐齐哈尔市'],
		'江苏省' : ["南京市","苏州市","无锡市","常州市","镇江市","南通市","泰州市","扬州市","盐城市","连云港市","徐州市","淮安市","宿州市"],
		'湖北省' : ["武汉市","黄石市","十堰市","荆州市","宜昌市","襄樊市","鄂州市","孝感市","黄冈市","咸宁市","仙桃市"],
		'四川省' : ["成都市","自贡市","攀枝花市","德阳市","绵阳市","雅安市"],
		'陕西省' : ["西安市","铜川市","宝鸡市","延安市","榆林市","汉中市"],
		'河南省' : ["郑州市","开封市","洛阳市","焦作市","许昌市","商丘市"],
		'山东省' : ["济南市","青岛市","淄博市","枣庄市","烟台市","潍坊市"],
		'安徽省' : ["合肥市","芜湖市","蚌埠市","安庆市","黄山市","六安市"],
		'浙江省' : ["杭州市","嘉兴市","绍兴市","温州市","宁波市","湖州市"],
		'福建省' : ["福州市","厦门市","莆田市","三明市","泉州市","南平市"],
		'湖南省' : ["长沙市","株洲市","湘潭市","衡阳市","岳阳市","张家界市"],
		'广西省' : ["南宁市","柳州市","桂林市","梧州市","北海市","钦州市"],
		'江西省' : ["南昌市","上饶市","赣州市","萍乡市","宜春市","景德镇市"],
		'贵州省' : ["贵阳市","六盘水市","遵义市","安顺市","铜仁市","毕节市"],
		'云南省' : ["昆明市","曲靖市","遵义市","玉溪市","保山市","丽江市"],
		'西藏' : ["拉萨市","那曲地区","昌都地区","林芝地区","山南区","日喀则"],
		'甘肃省' : ["兰州市","天水市","酒泉市 ","张掖市","定西市"],
		'宁夏' : ["银川市","中卫市","固原市","吴忠市","石嘴山市"],
		'青海' : ["西宁市"],
		'新疆' : ["乌鲁木齐市","吐鲁番市","和田市","石河子","阿拉尔"],
		'海南省' : ["海口市","三亚市","琼海市","儋州市","五指山市"],
		'海南省' : ["海口市","三亚市","琼海市","儋州市","五指山市"],
		'台湾省' : ['其他'],
		'香港特别行政区' : ['其他'],
		'澳门特别行政区' : ['其他']
	},
	// 获取所有省份
	getProvinces : function(){
		var provinces = [];
		for (var item in this.cityInfo){
			provinces.push(item);
		}
		return provinces;
	},
	// 获取某省份所有城市
	getCities : function(provinceName){
		return this.cityInfo[provinceName] || [];
	}
}
module.exports = _cities;